theses_backend/app/controllers/thesis_proposals_controller.rb

SELECT * FROM "thesis_proposals"
---
  def index
    @thesis_proposals = ThesisProposal.all

SELECT * FROM "thesis_proposals" WHERE ("thesis_proposals"."id" = 1)
---
  def show
    @thesis_proposal = ThesisProposal.find(params[:id])

INSERT INTO "thesis_proposals" ("execution_time", "student_id", "created_at", "title", "professor_id", "updated_at", "consultant_name", "programming_technologies", "annotation", "description", "accepted") VALUES(42, 1, '2010-06-27 15:26:28', 'Testing Proposal', 3, '2010-06-27 15:26:28', 'Boiko', 'Rails', 'Very cool...', 'Verewlkfasdl fjasdlkg sd', NULL)
---
  def create
    @thesis_proposal = ThesisProposal.new(params[:thesis_proposal])

    respond_to do |format|
      if @thesis_proposal.save

SELECT * FROM "thesis_proposals" WHERE ("thesis_proposals"."id" = 1)
UPDATE "thesis_proposals" SET "updated_at" = '2010-06-27 16:18:55', "title" = 'Changed' WHERE "id" = 1
---
  def update
    @thesis_proposal = ThesisProposal.find(params[:id])

    respond_to do |format|
      if @thesis_proposal.update_attributes(params[:thesis_proposal])